MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J90/mcu.h
// Register: LCDDATA17
#define LCDDATA17 LCDDATA17
extern volatile unsigned char           LCDDATA17           __at(0xF77);
#ifndef _LIB_BUILD
asm("LCDDATA17 equ 0F77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA17              :8;
    };
    struct {
        unsigned S40C2                  :1;
        unsigned S41C2                  :1;
        unsigned S42C2                  :1;
        unsigned S43C2                  :1;
        unsigned S44C2                  :1;
        unsigned S45C2                  :1;
        unsigned S46C2                  :1;
        unsigned S47C2                  :1;
    };
    struct {
        unsigned SEG40COM2              :1;
        unsigned SEG41COM2              :1;
        unsigned SEG42COM2              :1;
        unsigned SEG43COM2              :1;
        unsigned SEG44COM2              :1;
        unsigned SEG45COM2              :1;
        unsigned SEG46COM2              :1;
        unsigned SEG47COM2              :1;
    };
} LCDDATA17bits_t;
extern volatile LCDDATA17bits_t LCDDATA17bits __at(0xF77);
// bitfield macros
#define _LCDDATA17_LCDDATA17_POSN                           0x0
#define _LCDDATA17_LCDDATA17_POSITION                       0x0
#define _LCDDATA17_LCDDATA17_SIZE                           0x8
#define _LCDDATA17_LCDDATA17_LENGTH                         0x8
#define _LCDDATA17_LCDDATA17_MASK                           0xFF
#define _LCDDATA17_S40C2_POSN                               0x0
#define _LCDDATA17_S40C2_POSITION                           0x0
#define _LCDDATA17_S40C2_SIZE                               0x1
#define _LCDDATA17_S40C2_LENGTH                             0x1
#define _LCDDATA17_S40C2_MASK                               0x1
#define _LCDDATA17_S41C2_POSN                               0x1
#define _LCDDATA17_S41C2_POSITION                           0x1
#define _LCDDATA17_S41C2_SIZE                               0x1
#define _LCDDATA17_S41C2_LENGTH                             0x1
#define _LCDDATA17_S41C2_MASK                               0x2
#define _LCDDATA17_S42C2_POSN                               0x2
#define _LCDDATA17_S42C2_POSITION                           0x2
#define _LCDDATA17_S42C2_SIZE                               0x1
#define _LCDDATA17_S42C2_LENGTH                             0x1
#define _LCDDATA17_S42C2_MASK                               0x4
#define _LCDDATA17_S43C2_POSN                               0x3
#define _LCDDATA17_S43C2_POSITION                           0x3
#define _LCDDATA17_S43C2_SIZE                               0x1
#define _LCDDATA17_S43C2_LENGTH                             0x1
#define _LCDDATA17_S43C2_MASK                               0x8
#define _LCDDATA17_S44C2_POSN                               0x4
#define _LCDDATA17_S44C2_POSITION                           0x4
#define _LCDDATA17_S44C2_SIZE                               0x1
#define _LCDDATA17_S44C2_LENGTH                             0x1
#define _LCDDATA17_S44C2_MASK                               0x10
#define _LCDDATA17_S45C2_POSN                               0x5
#define _LCDDATA17_S45C2_POSITION                           0x5
#define _LCDDATA17_S45C2_SIZE                               0x1
#define _LCDDATA17_S45C2_LENGTH                             0x1
#define _LCDDATA17_S45C2_MASK                               0x20
#define _LCDDATA17_S46C2_POSN                               0x6
#define _LCDDATA17_S46C2_POSITION                           0x6
#define _LCDDATA17_S46C2_SIZE                               0x1
#define _LCDDATA17_S46C2_LENGTH                             0x1
#define _LCDDATA17_S46C2_MASK                               0x40
#define _LCDDATA17_S47C2_POSN                               0x7
#define _LCDDATA17_S47C2_POSITION                           0x7
#define _LCDDATA17_S47C2_SIZE                               0x1
#define _LCDDATA17_S47C2_LENGTH                             0x1
#define _LCDDATA17_S47C2_MASK                               0x80
#define _LCDDATA17_SEG40COM2_POSN                           0x0
#define _LCDDATA17_SEG40COM2_POSITION                       0x0
#define _LCDDATA17_SEG40COM2_SIZE                           0x1
#define _LCDDATA17_SEG40COM2_LENGTH                         0x1
#define _LCDDATA17_SEG40COM2_MASK                           0x1
#define _LCDDATA17_SEG41COM2_POSN                           0x1
#define _LCDDATA17_SEG41COM2_POSITION                       0x1
#define _LCDDATA17_SEG41COM2_SIZE                           0x1
#define _LCDDATA17_SEG41COM2_LENGTH                         0x1
#define _LCDDATA17_SEG41COM2_MASK                           0x2
#define _LCDDATA17_SEG42COM2_POSN                           0x2
#define _LCDDATA17_SEG42COM2_POSITION                       0x2
#define _LCDDATA17_SEG42COM2_SIZE                           0x1
#define _LCDDATA17_SEG42COM2_LENGTH                         0x1
#define _LCDDATA17_SEG42COM2_MASK                           0x4
#define _LCDDATA17_SEG43COM2_POSN                           0x3
#define _LCDDATA17_SEG43COM2_POSITION                       0x3
#define _LCDDATA17_SEG43COM2_SIZE                           0x1
#define _LCDDATA17_SEG43COM2_LENGTH                         0x1
#define _LCDDATA17_SEG43COM2_MASK                           0x8
#define _LCDDATA17_SEG44COM2_POSN                           0x4
#define _LCDDATA17_SEG44COM2_POSITION                       0x4
#define _LCDDATA17_SEG44COM2_SIZE                           0x1
#define _LCDDATA17_SEG44COM2_LENGTH                         0x1
#define _LCDDATA17_SEG44COM2_MASK                           0x10
#define _LCDDATA17_SEG45COM2_POSN                           0x5
#define _LCDDATA17_SEG45COM2_POSITION                       0x5
#define _LCDDATA17_SEG45COM2_SIZE                           0x1
#define _LCDDATA17_SEG45COM2_LENGTH                         0x1
#define _LCDDATA17_SEG45COM2_MASK                           0x20
#define _LCDDATA17_SEG46COM2_POSN                           0x6
#define _LCDDATA17_SEG46COM2_POSITION                       0x6
#define _LCDDATA17_SEG46COM2_SIZE                           0x1
#define _LCDDATA17_SEG46COM2_LENGTH                         0x1
#define _LCDDATA17_SEG46COM2_MASK                           0x40
#define _LCDDATA17_SEG47COM2_POSN                           0x7
#define _LCDDATA17_SEG47COM2_POSITION                       0x7
#define _LCDDATA17_SEG47COM2_SIZE                           0x1
#define _LCDDATA17_SEG47COM2_LENGTH                         0x1
#define _LCDDATA17_SEG47COM2_MASK                           0x80

// Register: LCDDATA18
#define LCDDATA18 LCDDATA18
extern volatile unsigned char           LCDDATA18           __at(0xF78);
#ifndef _LIB_BUILD
asm("LCDDATA18 equ 0F78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA18              :8;
    };
    struct {
        unsigned S00C3                  :1;
        unsigned S01C3                  :1;
        unsigned S02C3                  :1;
        unsigned S03C3                  :1;
        unsigned S04C3                  :1;
        unsigned S05C3                  :1;
        unsigned S06C3                  :1;
        unsigned S07C3                  :1;
    };
    struct {
        unsigned SEG00COM3              :1;
        unsigned SEG01COM3              :1;
        unsigned SEG02COM3              :1;
        unsigned SEG03COM3              :1;
        unsigned SEG04COM3              :1;
        unsigned SEG05COM3              :1;
        unsigned SEG06COM3              :1;
        unsigned SEG07COM3              :1;
    };
    struct {
        unsigned S0C3                   :1;
        unsigned S1C3                   :1;
        unsigned S2C3                   :1;
        unsigned S3C3                   :1;
        unsigned S4C3                   :1;
        unsigned S5C3                   :1;
        unsigned S6C3                   :1;
        unsigned S7C3                   :1;
    };
} LCDDATA18bits_t;
extern volatile LCDDATA18bits_t LCDDATA18bits __at(0xF78);
// bitfield macros
#define _LCDDATA18_LCDDATA18_POSN                           0x0
#define _LCDDATA18_LCDDATA18_POSITION                       0x0
#define _LCDDATA18_LCDDATA18_SIZE                           0x8
#define _LCDDATA18_LCDDATA18_LENGTH                         0x8
#define _LCDDATA18_LCDDATA18_MASK                           0xFF
#define _LCDDATA18_S00C3_POSN                               0x0
#define _LCDDATA18_S00C3_POSITION                           0x0
#define _LCDDATA18_S00C3_SIZE                               0x1
#define _LCDDATA18_S00C3_LENGTH                             0x1
#define _LCDDATA18_S00C3_MASK                               0x1
#define _LCDDATA18_S01C3_POSN                               0x1
#define _LCDDATA18_S01C3_POSITION                           0x1
#define _LCDDATA18_S01C3_SIZE                               0x1
#define _LCDDATA18_S01C3_LENGTH                             0x1
#define _LCDDATA18_S01C3_MASK                               0x2
#define _LCDDATA18_S02C3_POSN                               0x2
#define _LCDDATA18_S02C3_POSITION                           0x2
#define _LCDDATA18_S02C3_SIZE                               0x1
#define _LCDDATA18_S02C3_LENGTH                             0x1
#define _LCDDATA18_S02C3_MASK                               0x4
#define _LCDDATA18_S03C3_POSN                               0x3
#define _LCDDATA18_S03C3_POSITION                           0x3
#define _LCDDATA18_S03C3_SIZE                               0x1
#define _LCDDATA18_S03C3_LENGTH                             0x1
#define _LCDDATA18_S03C3_MASK                               0x8
#define _LCDDATA18_S04C3_POSN                               0x4
#define _LCDDATA18_S04C3_POSITION                           0x4
#define _LCDDATA18_S04C3_SIZE                               0x1
#define _LCDDATA18_S04C3_LENGTH                             0x1
#define _LCDDATA18_S04C3_MASK                               0x10
#define _LCDDATA18_S05C3_POSN                               0x5
#define _LCDDATA18_S05C3_POSITION                           0x5
#define _LCDDATA18_S05C3_SIZE                               0x1
#define _LCDDATA18_S05C3_LENGTH                             0x1
#define _LCDDATA18_S05C3_MASK                               0x20
#define _LCDDATA18_S06C3_POSN                               0x6
#define _LCDDATA18_S06C3_POSITION                           0x6
#define _LCDDATA18_S06C3_SIZE                               0x1
#define _LCDDATA18_S06C3_LENGTH                             0x1
#define _LCDDATA18_S06C3_MASK                               0x40
#define _LCDDATA18_S07C3_POSN                               0x7
#define _LCDDATA18_S07C3_POSITION                           0x7
#define _LCDDATA18_S07C3_SIZE                               0x1
#define _LCDDATA18_S07C3_LENGTH                             0x1
#define _LCDDATA18_S07C3_MASK                               0x80
#define _LCDDATA18_SEG00COM3_POSN                           0x0
#define _LCDDATA18_SEG00COM3_POSITION                       0x0
#define _LCDDATA18_SEG00COM3_SIZE                           0x1
#define _LCDDATA18_SEG00COM3_LENGTH                         0x1
#define _LCDDATA18_SEG00COM3_MASK                           0x1
#define _LCDDATA18_SEG01COM3_POSN                           0x1
#define _LCDDATA18_SEG01COM3_POSITION                       0x1
#define _LCDDATA18_SEG01COM3_SIZE                           0x1
#define _LCDDATA18_SEG01COM3_LENGTH                         0x1
#define _LCDDATA18_SEG01COM3_MASK                           0x2
#define _LCDDATA18_SEG02COM3_POSN                           0x2
#define _LCDDATA18_SEG02COM3_POSITION                       0x2
#define _LCDDATA18_SEG02COM3_SIZE                           0x1
#define _LCDDATA18_SEG02COM3_LENGTH                         0x1
#define _LCDDATA18_SEG02COM3_MASK                           0x4
#define _LCDDATA18_SEG03COM3_POSN                           0x3
#define _LCDDATA18_SEG03COM3_POSITION                       0x3
#define _LCDDATA18_SEG03COM3_SIZE                           0x1
#define _LCDDATA18_SEG03COM3_LENGTH                         0x1
#define _LCDDATA18_SEG03COM3_MASK                           0x8
#define _LCDDATA18_SEG04COM3_POSN                           0x4
#define _LCDDATA18_SEG04COM3_POSITION                       0x4
#define _LCDDATA18_SEG04COM3_SIZE                           0x1
#define _LCDDATA18_SEG04COM3_LENGTH                         0x1
#define _LCDDATA18_SEG04COM3_MASK                           0x10
#define _LCDDATA18_SEG05COM3_POSN                           0x5
#define _LCDDATA18_SEG05COM3_POSITION                       0x5
#define _LCDDATA18_SEG05COM3_SIZE                           0x1
#define _LCDDATA18_SEG05COM3_LENGTH                         0x1
#define _LCDDATA18_SEG05COM3_MASK                           0x20
#define _LCDDATA18_SEG06COM3_POSN                           0x6
#define _LCDDATA18_SEG06COM3_POSITION                       0x6
#define _LCDDATA18_SEG06COM3_SIZE                           0x1
#define _LCDDATA18_SEG06COM3_LENGTH                         0x1
#define _LCDDATA18_SEG06COM3_MASK                           0x40
#define _LCDDATA18_SEG07COM3_POSN                           0x7
#define _LCDDATA18_SEG07COM3_POSITION                       0x7
#define _LCDDATA18_SEG07COM3_SIZE                           0x1
#define _LCDDATA18_SEG07COM3_LENGTH                         0x1
#define _LCDDATA18_SEG07COM3_MASK                           0x80
#define _LCDDATA18_S0C3_POSN                                0x0
#define _LCDDATA18_S0C3_POSITION                            0x0
#define _LCDDATA18_S0C3_SIZE                                0x1
#define _LCDDATA18_S0C3_LENGTH                              0x1
#define _LCDDATA18_S0C3_MASK                                0x1
#define _LCDDATA18_S1C3_POSN                                0x1
#define _LCDDATA18_S1C3_POSITION                            0x1
#define _LCDDATA18_S1C3_SIZE                                0x1
#define _LCDDATA18_S1C3_LENGTH                              0x1
#define _LCDDATA18_S1C3_MASK                                0x2
#define _LCDDATA18_S2C3_POSN                                0x2
#define _LCDDATA18_S2C3_POSITION                            0x2
#define _LCDDATA18_S2C3_SIZE                                0x1
#define _LCDDATA18_S2C3_LENGTH                              0x1
#define _LCDDATA18_S2C3_MASK                                0x4
#define _LCDDATA18_S3C3_POSN                                0x3
#define _LCDDATA18_S3C3_POSITION                            0x3
#define _LCDDATA18_S3C3_SIZE                                0x1
#define _LCDDATA18_S3C3_LENGTH                              0x1
#define _LCDDATA18_S3C3_MASK                                0x8
#define _LCDDATA18_S4C3_POSN                                0x4
#define _LCDDATA18_S4C3_POSITION                            0x4
#define _LCDDATA18_S4C3_SIZE                                0x1
#define _LCDDATA18_S4C3_LENGTH                              0x1
#define _LCDDATA18_S4C3_MASK                                0x10
#define _LCDDATA18_S5C3_POSN                                0x5
#define _LCDDATA18_S5C3_POSITION                            0x5
#define _LCDDATA18_S5C3_SIZE                                0x1
#define _LCDDATA18_S5C3_LENGTH                              0x1
#define _LCDDATA18_S5C3_MASK                                0x20
#define _LCDDATA18_S6C3_POSN                                0x6
#define _LCDDATA18_S6C3_POSITION                            0x6
#define _LCDDATA18_S6C3_SIZE                                0x1
#define _LCDDATA18_S6C3_LENGTH                              0x1
#define _LCDDATA18_S6C3_MASK                                0x40
#define _LCDDATA18_S7C3_POSN                                0x7
#define _LCDDATA18_S7C3_POSITION                            0x7
#define _LCDDATA18_S7C3_SIZE                                0x1
#define _LCDDATA18_S7C3_LENGTH                              0x1
#define _LCDDATA18_S7C3_MASK                                0x80

// Register: LCDDATA19
#define LCDDATA19 LCDDATA19
extern volatile unsigned char           LCDDATA19           __at(0xF79);
#ifndef _LIB_BUILD
asm("LCDDATA19 equ 0F79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA19              :8;
    };
    struct {
        unsigned S8C3                   :1;
        unsigned S9C3                   :1;
        unsigned S10C3                  :1;
        unsigned S11C3                  :1;
        unsigned S12C3                  :1;
        unsigned S13C3                  :1;
        unsigned S14C3                  :1;
        unsigned S15C3                  :1;
    };
    struct {
        unsigned SEG8COM3               :1;
        unsigned SEG9COM3               :1;
        unsigned SEG10COM3              :1;
        unsigned SEG11COM3              :1;
        unsigned SEG12COM3              :1;
        unsigned SEG13COM3              :1;
        unsigned SEG14COM3              :1;
        unsigned SEG15COM3              :1;
    };
    struct {
        unsigned S08C3                  :1;
        unsigned S09C3                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned T3CKPS019              :1;
        unsigned T3CKPS119              :1;
        unsigned TMR3CS019              :1;
        unsigned TMR3CS119              :1;
    };
} LCDDATA19bits_t;
